# AnnotationSymbol Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnnotationSymbol Class
Members See Also
---
This object represents a symbol of the Generic Annotation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class AnnotationSymbol : FamilyInstance
```

Visual Basic
---
```text
Public Class AnnotationSymbol _
	Inherits FamilyInstance
```

Visual C++
---
```text
public ref class AnnotationSymbol : public FamilyInstance
```

# Remarks
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..Instance Autodesk.Revit.DB..::..FamilyInstance Autodesk.Revit.DB..::..AnnotationSymbol
# See Also
AnnotationSymbol Members
Autodesk.Revit.DB Namespace